const questions = {
  1: {
    title: "집에 왔는데 아무도 없다.",
    type: "EI",
    A: "깜깜하고 외롭다 😢",
    B: "드디어 나만의 시간! 행복하다 😆",
  },
  2: {
    title: "하고싶은 취미생활이 생겼다.",
    type: "EI",
    A: "동호회에 가입하여 많은 사람들과 어울린다.",
    B: "혼자 하는게 편하다. 혼자만의 취미생활을 즐긴다!",
  },
  3: {
    title: "대화의 흐름이 끊기는걸 참을 수 없다.",
    type: "EI",
    A: "끊기면 끊기는거지 뭐...",
    B: "참을 수 없다 이 어색함...",
  },
  4: {
    title: "죽으면 어떡하지?",
    type: "SN",
    A: "죽으면 죽는거지 뭘 생각해? 🤪",
    B: "신과함께에서는 지옥가던데... 나는 무슨 벌을 받을까? 기억은 다 사라지는건가?(🥺)",
  },
  5: {
    title: "비행기를 탔는데 흔들린다.",
    type: "SN",
    A: "비행기가 흔들리네. 멀미나는거같기도 하구...",
    B: "이러다 추락하는거 아니야? 비상구가 어디지? 탈출은 어떻게해야하지?? 😵‍💫",
  },
  6: {
    title: "사과를 보고 드는 생각은?",
    type: "SN",
    A: "빨갛다 🍎",
    B: "백설공주",
  },
  7: {
    title: "친구가 시험에 떨어졌다.",
    type: "TF",
    A: "몇점으로 떨어진건데? (진심 궁금)",
    B: "걱정 마! 다음에는 꼭 붙을꺼야!",
  },
  8: {
    title: "친구가 차 사고가 났다.",
    type: "TF",
    A: "병원부터 가야지 일단! 보험은 있어? 💸",
    B: "안다쳤어? 몸은 괜찮아? ㅠㅠ",
  },
  9: {
    title: "공연이 시작되었다. 화려한 무대장치를 보면서 든 생각은?",
    type: "TF",
    A: "어떻게 저렇게 움직이지? 너무 신기하다. 저 장치의 원리는 뭘까? 🤔",
    B: "저렇게 큰 장치로 연습하려면 배우들이 무섭지는 않았을까?",
  },
  10: {
    title: "여행 어떻게갈까?",
    type: "JP",
    A: "오늘 아침은 어디, 저녁은 어디... 이미 다 짜놨지!",
    B: "응? 그냥 가는거 아냐?",
  },
  11: {
    title: "뭐해? 심심한데 나와!",
    type: "JP",
    A: "응? 왜? (속마음: 계획에 없던건데...)",
    B: "당근 좋지! 지금 나가는중~",
  },
  12: {
    title: "오늘 뭐 먹을까?",
    type: "JP",
    A: "이 지역 맛집 리스트는 말이야...",
    B: "저기 맛있어보인다. 나 배고파",
  },
};

export default questions;
