const res = {
  type: {
    ENTP: "1",  //비틀쥬스
    INTJ: "2",   //엘파바
    INTP: "2",
    ENTJ: "3",  // 자베르
    ESFP: "4",    //아이다
    ENFJ: "1",
    ESTP: "5",    //글린다
    ISTP: "4",    
    ISFP: "6",    //지킬
    INFP: "7",    //돈키호테
    INFJ: "8",    // 장발장
    ENFP: "7",
    ISFJ: "5",
    ESFJ: "5",
    ISTJ: "6",
    ESTJ: "3",
  },
  character: {
    "0" : {
      character: "테스트를 통해 부캐를 얻어보세요!",
      img: "../assets/test/0.svg",
    },
    "1" : {
      character: "비틀쥬스",
      title1: "너 정말 내가 보이는구나!",
      title2: "새로운 단짝이 생긴 거야",
      explain1:
        "✔ 집에 들어온 사람들을 겁주는 데 도가 튼 비틀쥬스처럼, 당신의 짓궂은 성격과 저 세상 텐션은 종종 주위의 친한 사람들을 겁주는거나 놀리는 데 쓰일 때도 있습니다.",
      explain2:
        "✔ 그러나 그조차도 당신의 매력이죠! 종종 충동적이고 즉흥적일 때도 있지만 그게 당신의 삶인걸요. 그 덕분에 새로운 일에 있어서도 도전을 두려워하지 않는 편입니다. 당신은 넘치는 에너지만큼이나 넘치는 재주로, 남들은 한 두개 하기도 어려운 능력을 다양하게 섭렵하고 있습니다.",
      explain3:
        "✔ 당신의 잠재력을 높이 평가해주고 넘치는 당신의 텐션에 함께할 수 있는 동료를 찾아보세요. 분명 둘도 없는 친구가 될 수 있을 것입니다.",
      img: "../assets/test/1.svg",
      mate: "ENFP",
    },
    "2" : {
      character: "엘파바",
      title1: "내 길을 갈거야",
      title2: "시도하기 전엔 누구도 알 수 없어",
      explain1:
        "✔ 오즈의 쉬즈대학에서 탁월한 마법사의 재능을 가진 엘파바처럼, 당신은 논리적이고 객관적인 사고에 비상한 재능을 가진 사람입니다.",
      explain2:
        "✔ 냉철하고 객관적인 당신, 누구보다 이성적이고 합리적인 사고로 과제를 해결해나가는군요. 해결해나가는 과정 또한 결단력 있고 철두철미해서 당신의 과제는 언제나 뛰어난 결과로 탄생합니다.",
      explain3:
        "✔ 독립심 또한 강해서 때로는 타인과 관계를 맺는 것에 어려움을 느낄 수 있지만, 당신은 감정에 약간 서툴 뿐이지 사실 감성은 풍부합니다. 이러한 당신의 매력에 빠진 사람들과 우연한 기회에 깊은 관계를 맺을 수도 있습니다.",
      img: "../assets/test/2.svg",
      mate: "INFJ",
    },
    "3" : {
      character: "자베르",
      title1: "내가 해야 할 일은",
      title2: "법을 지키는 것뿐이지",
      explain1:
        "✔ 철저한 원리원칙 하에 만들어진 당신의 신념과 규칙은, 당신의 행동을 결정하는 중요한 기준입니다. 사건을 논리와 사실에 기반하여 분석하고 계획하는 건 당신의 자랑할 만한 능력이죠.",
      explain2:
        "✔ 리더로서의 자질도 뛰어납니다. 여러 사람들과 함께 진행하는 프로젝트에서 일을 적극적으로 추진해 나가는 모습이 멋있습니다. 게다가 이러한 면모 뒤에는 인간적이고 따뜻한 감성까지도 함께 가지고 있군요.",
      explain3:
        "✔ 당신의 원리와 원칙을 존중하면서도 유연한 시각을 넓혀줄 수 있는 사람을 만난다면 좋은 인연이 되리라 생각합니다.",
      img: "../assets/test/3.svg",
      mate: "ESTJ",
    },
    "4" : {
      character: "아이다",
      title1: "내 자신은 스스로 지키겠어",
      title2: "쓰러져도 포기하지 않아",
      explain1:
        "✔ 포로로 끌려간 상황에서도 기개를 잃지 않은 아이다처럼 당신은 올곧고 고귀한 성정을 지닌 사람입니다.",
      explain2:
        "✔ 외부의 요소들에 굴하지 않고 자신을 지키려는 당신은, 자유롭고 솔직한 본인의 모습을 다른 누구보다 스스로 아껴줄 수 있는 사람이군요. 사람들에게 선입견 없이 다가가는 당신은 어디서든 잘 적응하며 다양한 사람들과 어울리는 것을 즐거워합니다. 삶의 모든 요소들을 즐기며 살 줄 아는 당신은, 가끔씩 '화끈한 성격'을 표출할 때도 있습니다.",
      explain3:
        "✔ 당신의 독립적인 면모를 존중해주고 배려해주는 사람이라면 당신의 고민을 잘 들어줄 친구가 되어줄 수 있을 것입니다.",
      img: "../assets/test/4.svg",
      mate: "ISTJ",
    },
    "5" : {
      character: "글린다",
      title1: "밀어내 봐도, 싫은 척해도",
      title2: "날 막을 순 없어",
      explain1:
        "✔ 당신은 어딜 가든 사람들의 시선을 한몸에 받는 인싸 기질을 가지고 있군요!",
      explain2:
        "✔ 자신의 매력을 잘 알고 있고, 그를 표출하는 방법 또한 잘 알고 있어 어디서든 눈에 띄는 존재일 것입니다. 자신을 향한 시선조차 즐길 줄 아는 당신은 진정한 '인싸'라고 할 수 있습니다.",
      explain3:
        "✔ 누구보다 특별한 당신의 매력을 알아보는 사람이라면 당신과 둘도 없는 친구가 될 수 있을 것입니다.",
      img: "../assets/test/5.svg",
      mate: "ENFJ",
    },
    "6" : {
      character: "지킬",
      title1: "던지리라, 바치리라",
      title2: "애타게 찾던 절실한 소원을 위해",
      explain1:
        "✔ 인간의 이중성에 대한 탐구로 치료제를 개발하고자 하는 지킬처럼, 당신은 논리적이면서도 타인에게 헌신적인 사람입니다.",
      explain2:
        "✔ 당신은 주변 사람들에게 굉장히 모범적인 이미지를 가지고 있습니다. 노력파적인 모습, 책임감, 자제력, 자기 관리하는 모습이 사람들에게 호감을 주고는 하죠. 어릴 적에도 의젓하다는 말을 많이 들었으리라 생각합니다.",
      explain3:
        "✔ 눈에 띄기보다는 남들과 같은 삶을 추구하는 편이기에 때로는 평범해보일 수도 있지만, 사실 누구보다 성실하고 책임감 있는 삶의 자세를 가지고 있죠. 이런 당신의 매력을 알아보는 사람이 분명히 있을 거예요.",
      img: "../assets/test/6.svg",
      mate: "ESFP",
    },
    "7" : {
      character: "돈키호테",
      title1: "잡을 수 없는 별일지라도",
      title2: "힘껏 팔을 뻗으리라",
      explain1:
        "✔ 알돈자가 '태어나 처음으로 인간답게 살 수 있을 것 같다'라고 생각할 정도로 진심을 다해주었던 돈키호테처럼, 당신은 주위 사람들에게 애정을 표현하고 그들을 기쁘게 해줄 수 있는 사람입니다.",
      explain2:
        "✔ 인생을 즐겁게 살고자 하는 당신은, 새로운 시도를 주저하지 않습니다. 사람 만나는 걸 무척 좋아해서 행사나 각종 일을 주도하는 자리에 종종 서기도 합니다. 다툼을 피하고자 스스로 양보를 하기도 하는군요! 따뜻하고 정열적인 마음의 소유자인 당신은 어디서든 탐험 할 수 있고, 가능성을 발견할 수 있는 사람입니다.",
      explain3:
        "✔ 당신의 이상향을 이해해 주고, 당신과 뜻을 함께해줄 사람을 만난다면 당신에게 있어 최고의 행복이 될 것입니다.",
      img: "../assets/test/7.svg",
      mate: "ENTP",
    },
    "8" : {
      character: "장발장",
      title1: "이웃을 사랑하는 것은",
      title2: "주님의 얼굴을 보는 것",
      explain1:
        "✔ 사업가로 크게 성공한 후 벌어들인 돈의 절반을 사회에 기부한 장발장처럼, 다른 사람들을 돕는 것은 당신에게 있어서 삶의 중요한 가치 중 하나입니다.",
      explain2:
        "✔ 뛰어난 당신은 확고한 자신만의 신념과 이를 구현하고자 하는 열정으로 살아갑니다. 직관력이 뛰어나 다른 사람들의 감정을 잘 파악하고 공감해주지만, 동시에 혼자만의 시간이 필요로 하기도 합니다. 장발장과 코제트의 관계와 같이, 마음이 맞는 사람 몇몇과 깊은 관계를 맺고 애정을 쏟는 것을 더 편안하게 느끼는군요.",
      explain3:
        "✔ 당신의 착한 성정을 이용하지 않으면서도 혼자만의 시간을 존중해줄 사람을 찾는다면, 당신이 원하는 깊은 관계를 맺을 수 있을 겁니다.",
      img: "../assets/test/8.svg",
      mate: "ENFP",
    },
  }
};

// const type_nums = {
//   ENTP: "1",  //비틀쥬스
//   INTJ: "2",   //엘파바
//   INTP: "2",
//   ENTJ: "3",  // 자베르
//   ESFP: "4",    //아이다
//   ENFJ: "1",
//   ESTP: "5",    //글린다
//   ISTP: "4",    
//   ISFP: "6",    //지킬
//   INFP: "7",    //돈키호테
//   INFJ: "8",    // 장발장
//   ENFP: "7",
//   ISFJ: "5",
//   ESFJ: "5",
//   ISTJ: "6",
//   ESTJ: "3",
// }

export default res;
