const results = {
  ENTP: {
    character: "비틀쥬스",
    title1: "너 정말 내가 보이는구나!",
    title2: "새로운 단짝이 생긴 거야",
    explain1:
      "✔ 집에 들어온 사람들을 겁주는 데 도가 튼 비틀쥬스처럼, 당신의 짓궂은 성격과 저 세상 텐션은 종종 주위의 친한 사람들을 겁주는거나 놀리는 데 쓰일 때도 있습니다.",
    explain2:
      "✔ 그러나 그조차도 당신의 매력이죠! 종종 충동적이고 즉흥적일 때도 있지만 그게 당신의 삶인걸요. 그 덕분에 새로운 일에 있어서도 도전을 두려워하지 않는 편입니다. 당신은 넘치는 에너지만큼이나 넘치는 재주로, 남들은 한 두개 하기도 어려운 능력을 다양하게 섭렵하고 있습니다.",
    explain3:
      "✔ 당신의 잠재력을 높이 평가해주고 넘치는 당신의 텐션에 함께할 수 있는 동료를 찾아보세요. 분명 둘도 없는 친구가 될 수 있을 것입니다.",
    img: "../assets/test/beetle_juice.svg",
    mate: "ENFP",
  },
  INTJ: {
    character: "엘파바",
    title1: "내 길을 갈거야",
    title2: "시도하기 전엔 누구도 알 수 없어",
    explain1:
      "✔ 오즈의 쉬즈대학에서 탁월한 마법사의 재능을 가진 엘파바처럼, 당신은 논리적이고 객관적인 사고에 비상한 재능을 가진 사람입니다.",
    explain2:
      "✔ 냉철하고 객관적인 당신, 누구보다 이성적이고 합리적인 사고로 과제를 해결해나가는군요. 해결해나가는 과정 또한 결단력 있고 철두철미해서 당신의 과제는 언제나 뛰어난 결과로 탄생합니다.",
    explain3:
      "✔ 독립심 또한 강해서 때로는 타인과 관계를 맺는 것에 어려움을 느낄 수 있지만, 당신은 감정에 약간 서툴 뿐이지 사실 감성은 풍부합니다. 이러한 당신의 매력에 빠진 사람들과 우연한 기회에 깊은 관계를 맺을 수도 있습니다.",
    img: "../assets/test/elphaba.svg",
    mate: "INFJ",
  },
  INTP: {
    character: "마리 퀴리",
    title1: "궁금하니까요!",
    title2: "궁금한 걸 참을 수 없거든요",
    explain1:
      "✔ 모두가 불가능하다고 말했던 라듐 발견을 성공시킨 마리 퀴리처럼, 당신은 누구보다 논리적이면서도 독창적인 아이디어를 가진 사람입니다.",
    explain2:
      "✔ 당신은 논리적인 동시에 사색적인 사람이군요. 당신의 머릿속은 쉴 새 없이 쏟아지는 아이디어와 끊임없이 벌어지는 논쟁으로 가득합니다. 당신만의 독특한 관점이 당신의 논리와 맞아떨어지는 순간, 주변 사람들이 당신을 천재라고 부를 결과를 내고는 합니다.",
    explain3:
      "✔ 감정이 사고를 방해하는 것을 용납할 수 없는 당신, 당신이 어려움에 빠졌을 때 정서적인 위로보다는 함께 해결책을 찾아주는 사람과 함께한다면 큰 행복이 될 것입니다.",
    img: "../assets/test/elphaba.svg",
    mate: "ESTJ",
  },
  ENTJ: {
    character: "빌리 플린",
    title1: "비싼 자동차 관심 없어",
    title2: "최고급 시가도 난 아니야",
    explain1:
      "✔ 당신이 정한 목표는 실패하는 일이 없습니다. 한 번 목표를 정하면 철저한 분석과 계획으로 모든 경우의 수를 따져 대비하기 때문이죠.",
    explain2:
      "✔ 다른 사람들에게, 심지어 스스로에게조차 불가능에 가까워 보이는 어려운 일을 맞닥뜨리더라도 너무 걱정하지 마세요. 치밀한 계획과 추진력으로 무장한 당신은 무엇이든 할 수 있습니다. 그런 당신의 가능성과 잠재력을 언제나 믿어 주세요.",
    explain3:
      "✔ 당신의 능력을 인정해주고 찬사를 보내는 조력자를 만난다면 당신의 능력은 더욱 날개를 달게 될 것입니다. 기대되지 않나요?",
    img: "../assets/test/elphaba.svg",
    mate: "ISTP",
  },
  ESFP: {
    character: "피에로",
    title1: "춤을 추자 근심은 잊고",
    title2: "지나가면 그뿐인 것이 인생",
    explain1:
      "✔ 알고 보면 꽤나 사랑꾼인 당신! 좋아하는 사람을 위해 대신해서 붙잡힌 피에로처럼, 당신은 사랑을 위해서는 물불 가리지 않기도 합니다.",
    explain2:
      "✔ 당신은 분위기메이커. 웃음과 즐거움이 있는 곳이라면 당신이 빠질 수 없죠. 파티를 즐길 줄 아는 당신은 인간관계에 능숙하며, 사람들과 몇 시간이고 다양한 주제로 이야기를 나눌 수 있습니다. 위트와 재미있는 말솜씨는 기본이죠. 즉흥적인 삶에서 자유로움을 느끼는군요. 시간표가 짜여 있는 학교 생활처럼 규칙적이고 틀에 박힌 삶에 당신은 싫증을 느끼곤 합니다.",
    explain3:
      "✔ 많은 사람들을 만나지만, 그 중에서도 당신의 배려와 관심을 알아봐주고 고마움을 표현해주는 사람이라면 둘도 없는 친구로 지낼 수 있을 것입니다.",
    img: "../assets/test/elphaba.svg",
    mate: "ESTP",
  },
  ENFJ: {
    character: "에스메릴다",
    title1: "바다를 떠올릴 때면",
    title2: "나는 늘 그곳에 있지",
    explain1:
      "✔ 자유롭게 세상을 누비고 다니는 집시처럼 당신은 쾌활하고 사교적인 성격을 가지고 있군요. 그러면서도 당신은 누구보다 사람을 좋아하는 성격의 소유자입니다.",
    explain2:
      "✔ 관계를 맺는 것 자체가 소중해 타인에게 매우 열린 태도를 가지고 있죠. 모두가 멀리하는 콰지모도조차 처음엔 무서워했을지라도 결국 소중한 친구가 되었던 것처럼요! <br/><br/> ✔ 주변 사람들 또한 그런 당신에게 매력을 느껴, 딱히 의도하지 않았더라도 사랑받고 있을 가능성이 매우 높습니다.",
    explain3:
      "✔ 그러나 당신은 여전히 자유로움을 원합니다. 사람이 좋지만 동시에 인간 관계에 얽매이고 싶지 않죠. 당신의 자유로움을 존중해주며 묵묵히 곁을 지켜주는 사람을 만난다면 누구보다 단단한 관계를 맺을 수 있을 것입니다.",
    img: "../assets/test/elphaba.svg",
    mate: "ESFJ",
  },

  ESTP: {
    character: "아이다",
    title1: "내 자신은 스스로 지키겠어",
    title2: "쓰러져도 포기하지 않아",
    explain1:
      "✔ 포로로 끌려간 상황에서도 기개를 잃지 않은 아이다처럼 당신은 올곧고 고귀한 성정을 지닌 사람입니다.",
    explain2:
      "✔ 외부의 요소들에 굴하지 않고 자신을 지키려는 당신은, 자유롭고 솔직한 본인의 모습을 다른 누구보다 스스로 아껴줄 수 있는 사람이군요. 사람들에게 선입견 없이 다가가는 당신은 어디서든 잘 적응하며 다양한 사람들과 어울리는 것을 즐거워합니다. 삶의 모든 요소들을 즐기며 살 줄 아는 당신은, 가끔씩 '화끈한 성격'을 표출할 때도 있습니다.",
    explain3:
      "✔ 당신의 독립적인 면모를 존중해주고 배려해주는 사람이라면 당신의 고민을 잘 들어줄 친구가 되어줄 수 있을 것입니다.",
    img: "../assets/test/amneris.svg",
    mate: "ISTJ",
  },

  ISTP: {
    character: "에우리디케",
    title1: "가장 추운 밤은",
    title2: "봄이 오기 직전",
    explain1:
      "✔ 하데스의 지하세계에서도 침착함을 잃지 않는 에우리디케처럼, 당신은 낯설고 새로운 공간, 두려운 상황 속에서도 차분히 적절한 돌파구를 찾아냅니다.",
    explain2:
      "✔ 신중하고도 객관적인 당신, 만약 이겨내야 하는 과제 상황에 직면해 있다면, 스스로의 잠재력을 믿고 맡기는 것이 최고의 해결책이 될 것입니다. 오히려 이미 흥미로운 과제들을 즐기고 있지는 않은가요? 특히 직접 경험하고 부딪히며 해결할 수 있는 과제들이 당신의 호기심을 자극할 것입니다.",
    explain3:
      "✔ 신중히 과제를 해결해 나가는 당신에게 관심을 보이는 사람들, 당신은 그들에게 상냥하고 친절하군요. 하지만 동시에 온전한 당신의 영역이 필요하기 때문에, 그러한 당신의 영역을 존중해 주는 사람에게 더욱 호감을 느낄 것입니다.",
    img: "../assets/test/elphaba.svg",
    mate: "ESTJ",
  },
  ISFP: {
    character: "로저",
    title1: "내가 남길 노래 찾아야 해",
    title2: "불꽃 꺼지지 않게",
    explain1:
      "✔ 죽기 전에 사람들의 기억에 남을 만한 노래를 만들고자 하는 로저처럼, 당신은 잠재된 창의력을 놀라운 아름다움으로 나타내는 예술가입니다.",
    explain2:
      "✔ 평소 조용하고 수줍은 당신이지만 당신의 흥미를 돋게 하는 것이 생긴다면 다른 것들은 보이지 않을 정도로 빠져들게 됩니다. 결국 사람들에게 강렬한 인상을 남기는 아이디어를 만들곤 하죠.",
    explain3:
      "✔ 편안하고 따뜻한 성격을 가졌으며, 주변 사람들의 감정에 쉽게 공감하기 때문에 할 수 있는 한 갈등의 최소화를 추구합니다. 그래서인지 당신의 상상력과 탐구 정신은 대부분 타인을 돕는 결과를 내고는 합니다.",
    img: "../assets/test/elphaba.svg",
    mate: "ESFJ",
  },
  INFP: {
    character: "미스 허니",
    title1: "도움이 필요할 거야",
    title2: "강인하게 싸워줄 사람",
    explain1:
      "✔ 악덕 교장이 아이들을 함부로 다루는 상황에서도 다정하게 아이들을 사랑하고자 했던 미스 허니처럼, 당신은 자신이 생각하는 가치와 옳음을 실현시키려고 노력하는 사람입니다.",
    explain2:
      "✔ 당신을 잘 모르는 사람은 당신을 그저 조용하고 수줍음 많은 사람으로 알겠지만, 사실 당신은 좋아하는 일에 대해서는 누구보다 열정이 가득한 사람이죠! 최악의 상황에서도 긍정 에너지로 좋은 면을 바라볼 줄 아는 사람입니다. 누구보다 꿈과 이상에 진심인 당신은 때로는 비참한 현실에 상처를 받기도 하지만, 끝까지 희망과 용기를 잃지 않는 심지 굳은 면모를 가지고 있습니다.",
    explain3:
      "✔ 당신의 이상향을 알아주고, 나아가 그것을 함께 이뤄갈 수 있는 사람을 만난다면 당신에게 있어 최고의 행복이 될 것입니다.",
    img: "../assets/test/elphaba.svg",
    mate: "ISTP",
  },
  INFJ: {
    character: "장발장",
    title1: "이웃을 사랑하는 것은",
    title2: "주님의 얼굴을 보는 것",
    explain1:
      "✔ 사업가로 크게 성공한 후 벌어들인 돈의 절반을 사회에 기부한 장발장처럼, 다른 사람들을 돕는 것은 당신에게 있어서 삶의 중요한 가치 중 하나입니다.",
    explain2:
      "✔ 뛰어난 당신은 확고한 자신만의 신념과 이를 구현하고자 하는 열정으로 살아갑니다. 직관력이 뛰어나 다른 사람들의 감정을 잘 파악하고 공감해주지만, 동시에 혼자만의 시간이 필요로 하기도 합니다. 장발장과 코제트의 관계와 같이, 마음이 맞는 사람 몇몇과 깊은 관계를 맺고 애정을 쏟는 것을 더 편안하게 느끼는군요.",
    explain3:
      "✔ 당신의 착한 성정을 이용하지 않으면서도 혼자만의 시간을 존중해줄 사람을 찾는다면, 당신이 원하는 깊은 관계를 맺을 수 있을 겁니다.",
    img: "../assets/test/jean_valjean.svg",
    mate: "ENFP",
  },
  ENFP: {
    character: "돈키호테",
    title1: "잡을 수 없는 별일지라도",
    title2: "힘껏 팔을 뻗으리라",
    explain1:
      "✔ 알돈자가 '태어나 처음으로 인간답게 살 수 있을 것 같다'라고 생각할 정도로 진심을 다해주었던 돈키호테처럼, 당신은 주위 사람들에게 애정을 표현하고 그들을 기쁘게 해줄 수 있는 사람입니다.",
    explain2:
      "✔ 인생을 즐겁게 살고자 하는 당신은, 새로운 시도를 주저하지 않습니다. 사람 만나는 걸 무척 좋아해서 행사나 각종 일을 주도하는 자리에 종종 서기도 합니다. 다툼을 피하고자 스스로 양보를 하기도 하는군요! 따뜻하고 정열적인 마음의 소유자인 당신은 어디서든 탐험 할 수 있고, 가능성을 발견할 수 있는 사람입니다.",
    explain3:
      "✔ 당신의 이상향을 이해해 주고, 당신과 뜻을 함께해줄 사람을 만난다면 당신에게 있어 최고의 행복이 될 것입니다.",
    img: "../assets/test/donquixote.svg",
    mate: "ENTP",
  },
  ISFJ: {
    character: "크리스틴",
    title1: "사랑한다 내게 말해줘요",
    title2: "변치 않는 여린 날처럼",
    explain1:
      "✔ 오페라의 유령에게 의존하던 소녀에서 독립된 성인으로 자라게 되는 크리스틴처럼, 당신은 온화하고 섬세하며 인내심이 많지만 상황에 따라 누구보다 단호하고 차가운 면모를 보여주기도 하는 사람입니다.",
    explain2:
      "✔ 전형적인 외유내강형 면모를 가진 당신은 타인의 감정을 섬세하게 캐치하고, 특히 좋아하는 사람에게는 높은 충성심과 애정을 보여줍니다. 그러나 진솔하고 우직한 당신의 성격을 배신한다면 가차없이 끊어내는 단호함도 가진 사람입니다.",
    explain3:
      "✔ 당신의 친절을 만만히 보거나 이용하려 하지 않고 존중해줄 수 있는 사람을 만난다면 둘도 없는 인연이 될 수 있을 것입니다.",
    img: "../assets/test/elphaba.svg",
    mate: "ISTJ",
  },
  ESFJ: {
    character: "글린다",
    title1: "밀어내 봐도, 싫은 척해도",
    title2: "날 막을 순 없어",
    explain1:
      "✔ 당신은 어딜 가든 사람들의 시선을 한몸에 받는 인싸 기질을 가지고 있군요!",
    explain2:
      "✔ 자신의 매력을 잘 알고 있고, 그를 표출하는 방법 또한 잘 알고 있어 어디서든 눈에 띄는 존재일 것입니다. 자신을 향한 시선조차 즐길 줄 아는 당신은 진정한 '인싸'라고 할 수 있습니다.",
    explain3:
      "✔ 자신의 매력을 너무 잘 알고 있는 탓에 아주 조금은 얄미워 보일 때도 있지만, 그 얄미운 모습마저 사랑스러워 보이게 하는 방법을 잘 알고 있습니다. <br/><br/> ✔ 누구보다 특별한 당신의 매력을 알아보는 사람이라면 당신과 둘도 없는 친구가 될 수 있을 것입니다.",
    img: "../assets/test/glinda.svg",
    mate: "ENFJ",
  },
  ISTJ: {
    character: "지킬",
    title1: "던지리라, 바치리라",
    title2: "애타게 찾던 절실한 소원을 위해",
    explain1:
      "✔ 인간의 이중성에 대한 탐구로 치료제를 개발하고자 하는 지킬처럼, 당신은 논리적이면서도 타인에게 헌신적인 사람입니다.",
    explain2:
      "✔ 당신은 주변 사람들에게 굉장히 모범적인 이미지를 가지고 있습니다. 노력파적인 모습, 책임감, 자제력, 자기 관리하는 모습이 사람들에게 호감을 주고는 하죠. 어릴 적에도 의젓하다는 말을 많이 들었으리라 생각합니다.",
    explain3:
      "✔ 눈에 띄기보다는 남들과 같은 삶을 추구하는 편이기에 때로는 평범해보일 수도 있지만, 사실 누구보다 성실하고 책임감 있는 삶의 자세를 가지고 있죠. 이런 당신의 매력을 알아보는 사람이 분명히 있을 거예요.",
    img: "../assets/test/keykill.svg",
    mate: "ESFP",
  },
  ESTJ: {
    character: "자베르",
    title1: "내가 해야 할 일은",
    title2: "법을 지키는 것뿐이지",
    explain1:
      "✔ 철저한 원리원칙 하에 만들어진 당신의 신념과 규칙은, 당신의 행동을 결정하는 중요한 기준입니다. 사건을 논리와 사실에 기반하여 분석하고 계획하는 건 당신의 자랑할 만한 능력이죠.",
    explain2:
      "✔ 리더로서의 자질도 뛰어납니다. 여러 사람들과 함께 진행하는 프로젝트에서 일을 적극적으로 추진해 나가는 모습이 멋있습니다. 게다가 이러한 면모 뒤에는 인간적이고 따뜻한 감성까지도 함께 가지고 있군요.",
    explain3:
      "✔ 당신의 원리와 원칙을 존중하면서도 유연한 시각을 넓혀줄 수 있는 사람을 만난다면 좋은 인연이 되리라 생각합니다.",
    img: "../assets/test/javert.svg",
    mate: "ESTJ",
  },
};

export default results;
